nuevo_curso_bak/codelgniter/framework-4.6.0/framework-4.6.0/app/Controllers/productos.php

    public function index(): string
    {
        $ProductosModel = new ProductosModel();

        $productos = $ProductosModel ->findALL();
---
SELECT *
FROM `productos`

    public function ver($id){
        $productosModel = new ProductosModel();
        $producto = $productosModel ->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'